<div>
<img src=https://www.institutedata.com/wp-content/uploads/2019/10/iod_h_tp_primary_c.svg width="300">
</div>

# Lab 2.1.1
# *Data Wrangling and Munging with Pandas*

## Part 1: Wrangling Data

The term "data wrangling" is analogous to capturing wild horses and getting them into a fenced area; the horses are data and the fencing is your computer. The more common data wrangling tasks include:

- reading flat files
- reading Excel files
- downloading from web pages
  - csv
  - html
  - json

In [2]:
import numpy as np
import pandas as pd

*It is good practice to display the library version numbers for future reference:*

In [3]:
print('Numpy: ', np.__version__)
print('Pandas: ', pd.__version__)

Numpy:  1.23.5
Pandas:  1.5.3

### CSV Files

Below are three attempts to load the file "bikeshare.csv" into a DataFrame named `bikes`. Why are they wrong?

In [ ]:
# wrong:
bikes = pd.read_table('bikeshare.csv', header = None)
print(bikes.head())
print()

# wrong:
bikes = pd.read_table('bikeshare.csv', header = 1)
print(bikes.head())
print()

# wrong:
bikes = pd.read_table('bikeshare.csv', header = 0)
print(bikes.head())

ANSWER:

Load the file "bikeshare.csv" into a DataFrame named `bikes`, and confirm that it was loaded properly:

In [4]:
#ANSWER:
bikes = pd.read_csv("/Users/stephanienduaguba/Documents/DATA/bikeshare.csv")

SN_note: 'read_csv()' is specifically tailored for CSV files with a comma delimiter, while 'read_table()' is more flexible and can handle various delimiters. You can adjust the sep parameter to specify the delimiter based on the file format you're working with.

In [5]:
bikes

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0000,3,13,16
1,2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.80,0.0000,8,32,40
2,3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.80,0.0000,5,27,32
3,4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,0.0000,3,10,13
4,5,2011-01-01,1,0,1,4,0,6,0,1,0.24,0.2879,0.75,0.0000,0,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17374,17375,2012-12-31,1,1,12,19,0,1,1,2,0.26,0.2576,0.60,0.1642,11,108,119
17375,17376,2012-12-31,1,1,12,20,0,1,1,2,0.26,0.2576,0.60,0.1642,8,81,89
17376,17377,2012-12-31,1,1,12,21,0,1,1,1,0.26,0.2576,0.60,0.1642,7,83,90
17377,17378,2012-12-31,1,1,12,22,0,1,1,1,0.26,0.2727,0.56,0.1343,13,48,61
17378,17379,2012-12-31,1,1,12,23,0,1,1,1,0.26,0.2727,0.65,0.1343,12,37,49

Note that we could have used `read.csv()` above. When is `read_table()` necessary?

?:
ANSWER: When `sep` is not the comma character, or we need fine control that `read.csv()` does not provide.

Flat files can be full of surprises. Here are some issues to watch out for:

- separator character is something other than the comma
  - ";", "|", and tab are popular
- newline character is something other than what the O/S expects
  - Tip: Don't hard-code the character codes for carriage returns, linefeeds, etc. Use Python's built-in representation instead (e.g. Python translates "\n" to the newline character and "\t" to the tab character on any O/S).
- truncated lines
  - if there are empty fields at the end of a line it is possible that their separators will be missing, resulting in a "jagged" file
- embedded commas or quotes
  - a free-text field containing embedded commas may split into separate fields on input
  - a free-text field containing embedded quotes may not parse correctly
- unescaped characters
  - the "\" character indicates a control code to Python, which will break the I/O
    - e.g. the substring "\u0123" will be interpreted as Unicode(0123) -- which may not be what the file creator intended
  - these may need to be fixed by loading whole strings and then parsing into a new data frame
  
Tip: Most issues can be dealt with by correctly specifying the parameters of the function you use to load the file. Read the doco before reading the data!

### Reading Excel Files

In [6]:
from pandas import ExcelFile  # Nb. Need to install xlrd from conda (it does not automatically install with pandas)

In [7]:
pip install xlrd

Requirement already satisfied: xlrd in /Users/stephanienduaguba/anaconda3/lib/python3.10/site-packages (2.0.1)
Note: you may need to restart the kernel to use updated packages.

In [11]:
df = pd.read_excel('/Users/stephanienduaguba/Documents/DATA/Iris.xls', sheet_name = 'Data')
df

,Species_No,Petal_width,Petal_length,Sepal_width,Sepal_length,Species_name
0,1,0.2,1.4,3.5,5.1,Setosa
1,1,0.2,1.4,3.0,4.9,Setosa
2,1,0.2,1.3,3.2,4.7,Setosa
3,1,0.2,1.5,3.1,4.6,Setosa
4,1,0.2,1.4,3.6,5.0,Setosa
...,...,...,...,...,...,...
145,3,2.3,5.2,3.0,6.7,Verginica
146,3,1.9,5.0,2.5,6.3,Verginica
147,3,2.0,5.2,3.0,6.5,Verginica
148,3,2.3,5.4,3.4,6.2,Verginica
149,3,1.8,5.1,3.0,5.9,Verginica

In [12]:
df.columns

Index(['Species_No', 'Petal_width', 'Petal_length', 'Sepal_width',
       'Sepal_length', 'Species_name'],
      dtype='object')

It is usually better to load data correctly than to meddle with the source file or load it 'warts and all' and then try to parse it in code. The Pandas functions for reading files have parameters that provide the control we need. For example, we could make multiple calls to `read_excel()`, using combinations of the `header`, `usecols`, `skiprows`, `nrows`, and `skipfooter` parameters to load one table at a time from a spreadsheet with multiple tables.

Load the above file without the unwanted columns:

In [13]:
#ANSWER
filepath = '/Users/stephanienduaguba/Documents/DATA/Iris.xls'
use_columns = [ #'Species_No', 
    'Petal_width', 'Petal_length', 'Sepal_width', 'Sepal_length', #'Species_name'
]
df2 = pd.read_excel(filepath, usecols = use_columns)
df2

     Petal_width  Petal_length  Sepal_width  Sepal_length
0            0.2           1.4          3.5           5.1
1            0.2           1.4          3.0           4.9
2            0.2           1.3          3.2           4.7
3            0.2           1.5          3.1           4.6
4            0.2           1.4          3.6           5.0
..           ...           ...          ...           ...
145          2.3           5.2          3.0           6.7
146          1.9           5.0          2.5           6.3
147          2.0           5.2          3.0           6.5
148          2.3           5.4          3.4           6.2
149          1.8           5.1          3.0           5.9

[150 rows x 4 columns]

### Importing Data Directly from the Web

We usually want to store a local copy of a data file that we download from the Web, but when data retention is not a priority it is convenient to download the data directly into our running Python environment.

#### Importing Text Files from the Web

The web is the 'wild west' of data formats. However, we can usually expect good behaviour from files that are automatically generated by a service, such as the earthquake report:

In [24]:
df = pd.read_csv('https://earthquake.usgs.gov/earthquakes/feed/v1.0/summary/2.5_hour.csv')
df.head()

,time,latitude,longitude,depth,mag,magType,nst,gap,dmin,rms,...,updated,place,type,horizontalError,depthError,magError,magNst,status,locationSource,magSource
0,2023-09-05T02:18:52.573Z,19.3713,-155.257900,6.824,3.20,ml,17,125,0.0170,0.28,...,2023-09-05T02:25:45.040Z,"8 km SSW of Volcano, Hawaii",earthquake,0.97,1.715,0.060000,36,reviewed,us,us
1,2023-09-05T01:33:28.560Z,17.8370,-66.209167,9.430,2.73,md,10,213,0.1607,0.15,...,2023-09-05T02:00:53.290Z,"12 km S of Central Aguirre, Puerto Rico",earthquake,0.70,0.930,0.151274,5,reviewed,pr,pr

#### Importing HTML Files from the Web

Working with unstructured HTML files relies heavily on library functions. This one, however, is well-structured:

In [25]:
url = 'https://www.ccra.com/airport-codes/'

df = pd.read_html(url)
df

[                City      Country Code
 0            Aalborg      Denmark  AAL
 1           Aalesund       Norway  AES
 2             Aarhus      Denmark  AAR
 3     Abbotsford, BC       Canada  YXX
 4     Abbotsford, BC       Canada  YXX
 ...              ...          ...  ...
 1574        Zanzibar     Tanzania  ZNZ
 1575        Zaragoza        Spain  ZAZ
 1576       Zhengzhou        China  CGO
 1577        Zhoushan        China  HSN
 1578          Zurich  Switzerland  ZRH

 [1579 rows x 3 columns]]

In [28]:
df[0]

                City      Country Code
0            Aalborg      Denmark  AAL
1           Aalesund       Norway  AES
2             Aarhus      Denmark  AAR
3     Abbotsford, BC       Canada  YXX
4     Abbotsford, BC       Canada  YXX
...              ...          ...  ...
1574        Zanzibar     Tanzania  ZNZ
1575        Zaragoza        Spain  ZAZ
1576       Zhengzhou        China  CGO
1577        Zhoushan        China  HSN
1578          Zurich  Switzerland  ZRH

[1579 rows x 3 columns]

#### Importing XML Files from the Web

XML files are semi-structured, but you're at the mercy of the file creator. If every record has the same format it will be much easier, but practical applications often require a lot of custom code. Here is an example that includes a nice parser class: http://www.austintaylor.io/lxml/python/pandas/xml/dataframe/2016/07/08/convert-xml-to-pandas-dataframe/

#### Importing JSON Files from the Web

Like XML, JSON files are semi-structured and may require work to capture the schema into a dataframe. Here is a simple example:

In [29]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/data.json'

# Load the first sheet of the JSON file into a data frame
df = pd.read_json(url, orient = 'columns')
df.head()

   integer            datetime  category
0        5 2015-01-01 00:00:00         0
1        5 2015-01-01 00:00:01         0
2        9 2015-01-01 00:00:02         0
3        6 2015-01-01 00:00:03         0
4        6 2015-01-01 00:00:04         0

## Part 2: Data Munging

Data munging is manipulating data to get it into a form that we can start running analyses on (which usually means getting the data into a DataFrame). Before we get to this stage, we may need to remove headers or footers, transpose columns to rows, split wide data tables into long ones, and so on. (Nb. Excel files can be particularly troublesome, because users can format their data in mixed, complex shapes.) Essentially, we need to follow Hadley Wickham's guidelines for tidy datasets (http://vita.had.co.nz/papers/tidy-data.html):

The end goal of the cleaning data process:

- each variable should be in one column
- each observation should comprise one row
- each type of observational unit should form one table
- include key columns for linking multiple tables
- the top row contains (sensible) variable names
- in general, save data as one file per table

### Dataset Morphology

Once we have our dataset in a DataFrame (or Series, if our data is only 1-dimensional), we can start examining its size and content.

How many rows and columns are in `bikes`?

In [14]:
#ANSWER
bikes.shape

(17379, 17)

What are the column names in `bikes`?

In [15]:
#ANSWER
bikes.columns

Index(['instant', 'dteday', 'season', 'yr', 'mnth', 'hr', 'holiday', 'weekday',
       'workingday', 'weathersit', 'temp', 'atemp', 'hum', 'windspeed',
       'casual', 'registered', 'cnt'],
      dtype='object')

What are the data types of these columns?

In [16]:
#ANSWER
bikes.dtypes

instant         int64
dteday         object
season          int64
yr              int64
mnth            int64
hr              int64
holiday         int64
weekday         int64
workingday      int64
weathersit      int64
temp          float64
atemp         float64
hum           float64
windspeed     float64
casual          int64
registered      int64
cnt             int64
dtype: object

What is the (row) index for this DataFrame?

In [17]:
#ANSWER
bikes.index

RangeIndex(start=0, stop=17379, step=1)

https://www.dataquest.io/blog/python-json-tutorial/

## Slicing and Dicing

It is often preferable to refer to DataFrame columns by name, but there is more than one way to do this.
Do `bikes['season']` and `bikes[['season']]` give the same object? Demonstrate:

In [18]:
#ANSWER
bikes['season'] # Returns a Pandas Series (one-dim)

0        1
1        1
2        1
3        1
4        1
        ..
17374    1
17375    1
17376    1
17377    1
17378    1
Name: season, Length: 17379, dtype: int64

In [19]:
bikes[['season']] # Returns a Pandas DataFrame (two-dim)

       season
0           1
1           1
2           1
3           1
4           1
...       ...
17374       1
17375       1
17376       1
17377       1
17378       1

[17379 rows x 1 columns]

How would we use object notation to show the first 4 rows of `atemp`?

In [20]:
#ANSWER
bikes.atemp[:4]

# Or
# bikes['atemp'].head(4)
# bikes.atemp.head(4)

0    0.2879
1    0.2727
2    0.2727
3    0.2879
Name: atemp, dtype: float64

Algorithms that loop over multiple columns often access DataFrame columns by index. However, none of the following work (try them out by uncommenting / removing the "#E: " ):

In [21]:
#E: bikes[[0]]
#E: bikes[0]
#E: bikes[0,0]
#E: bikes[[0,0]]

In [22]:
bikes

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0000,3,13,16
1,2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.80,0.0000,8,32,40
2,3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.80,0.0000,5,27,32
3,4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,0.0000,3,10,13
4,5,2011-01-01,1,0,1,4,0,6,0,1,0.24,0.2879,0.75,0.0000,0,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17374,17375,2012-12-31,1,1,12,19,0,1,1,2,0.26,0.2576,0.60,0.1642,11,108,119
17375,17376,2012-12-31,1,1,12,20,0,1,1,2,0.26,0.2576,0.60,0.1642,8,81,89
17376,17377,2012-12-31,1,1,12,21,0,1,1,1,0.26,0.2576,0.60,0.1642,7,83,90
17377,17378,2012-12-31,1,1,12,22,0,1,1,1,0.26,0.2727,0.56,0.1343,13,48,61
17378,17379,2012-12-31,1,1,12,23,0,1,1,1,0.26,0.2727,0.65,0.1343,12,37,49

What is the correct way to access the 1st row of the DataFrame by its index?

In [23]:
#ANSWER
bikes.iloc[0:1]

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0,3,13,16

What is the correct way to access the 2nd column of the DataFrame by its index?

In [24]:
#ANSWER
bikes.iloc[:, 1]

0        2011-01-01
1        2011-01-01
2        2011-01-01
3        2011-01-01
4        2011-01-01
            ...
17374    2012-12-31
17375    2012-12-31
17376    2012-12-31
17377    2012-12-31
17378    2012-12-31
Name: dteday, Length: 17379, dtype: object

## Handling Missing Values

What is the Pandas `isnull` function for?

?
ANSWER:

We can apply `isnull` to the `bikes` DataFrame to show the result for every element:

In [25]:
bikes.isnull().head()

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

However, we usually start at a higher level. How many nulls are in `bikes` altogether?

In [26]:
#ANSWER
bikes.isnull().sum() # .sum() is used once to count the null values

instant       0
dteday        0
season        0
yr            0
mnth          0
hr            0
holiday       0
weekday       0
workingday    0
weathersit    0
temp          0
atemp         0
hum           0
windspeed     0
casual        0
registered    0
cnt           0
dtype: int64

In [27]:
bikes.isnull().sum().sum() # .sum() is used twice to sum those counts across columns

0

If this result were nonzero we would next want to find out which columns contained nulls. How can this be done in one line of code?

In [28]:
#ANSWER
bikes.isnull().any() # .any() is used to check all columns for nulls

instant       False
dteday        False
season        False
yr            False
mnth          False
hr            False
holiday       False
weekday       False
workingday    False
weathersit    False
temp          False
atemp         False
hum           False
windspeed     False
casual        False
registered    False
cnt           False
dtype: bool

In [29]:
# .isnull().any() returns a Series of boolean values. 
# '.columns' extracts column names from the DataFrame.
bikes.columns[bikes.isnull().any()]

Index([], dtype='object')

In [30]:
# Solution in class - to check one column
bikes['windspeed'].isnull().sum()

0

What is the Numpy object `nan` used for? (Write a descriptive answer.)

?
ANSWER:

SN_answer: "NaN" which means "Not-a-Number" is used to represent missing or undefined data in numerical arrays.

Write (and verify) a function that performs scalar division with built-in handling of the edge case (i.e. return a value instead of just trapping the error):

In [31]:
#ANSWER
# Function with ZeroDivisionError (ZDE) exception handling
def safe_division(numerator, denominator):
    try:
        result = numerator / denominator
        return result
    except ZeroDivisionError:
        return None

In [32]:
# Test of ZDE function
result1 = safe_division(3, 8)
print(result1)

result2 = safe_division(3, 0)
print(result2)

0.375
None

In [34]:
# Solution in class - using if else statement
def divide(dividend, divisor):
    if divisor == 0:
        quotient = np.nan
    else:
        quotient = dividend / divisor
    return quotient

# Test of divide function
print(divide(3, 8))
print(divide(3, 0))

0.375
nan

Apply the Pandas `isna` function to the following data objects:

In [35]:
x = 2.3
y = np.nan
print(x, y)

2.3 nan

In [41]:
#ANSWER
x_missing, y_missing = pd.isna(x), pd.isna(y) # .isna() is used to find missing values
print(x_missing, y_missing)

False True

In [42]:
array = np.array([[1, np.nan, 3], [4, 5, np.nan]])
print(array)

[[ 1. nan  3.]
 [ 4.  5. nan]]

In [43]:
#ANSWER
pd.isna(array)

array([[False,  True, False],
       [False, False,  True]])

How is the pandas I/O parameter `na_values` used?

? ANSWER:

SN_answer: "na_values" are used to specify a list of values that should be treated as missing or NaN (Not-a-Number) when reading data from external sources into Pandas DataFrame.

--Example of using "na_values" during data import:

import pandas as pd

na_values_list = ['NA', 'N/A', 'missing'] # Define a list of values to be treated as missing (e.g., 'NA', 'N/A', 'missing')

df = pd.read_csv('data.csv', na_values=na_values_list) # Read a CSV file while specifying na_values

## Data Profiling

### Counts

When there are categorical variables in a dataset we will want to know how many possible values there are in each column. (Nb. If the dataset is a sample of a larger one, our sample may not capture all possible values of every categorical.)

How many (different) seasons are in `bikes`?

In [50]:
#ANSWER
# Solution in class using .value_counts()
bikes['season'].value_counts().sort_index(ascending=True)

1    4242
2    4409
3    4496
4    4232
Name: season, dtype: int64

In [51]:
# Getting distinct values using .unique()
bikes['season'].unique()

array([1, 2, 3, 4])

### Ranges

Print the range of the `instant`, `dteday`, and `windspeed` columns:

In [57]:
#ANSWER
print('instant:', bikes['instant'].min(), 'to', bikes['instant'].max())
print('dteday:', bikes['dteday'].min(), 'to', bikes['dteday'].max())
print('windspeed:', bikes['windspeed'].min(), 'to', bikes['windspeed'].max())

instant: 1 to 17379
dteday: 2011-01-01 to 2012-12-31
windspeed: 0.0 to 0.8507

In [58]:
# Alternatively display range using .agg(['min', 'max'])
bikes[['instant', 'dteday', 'windspeed']].agg(['min', 'max'])

     instant      dteday  windspeed
min        1  2011-01-01     0.0000
max    17379  2012-12-31     0.8507

Compute and print the overall minimum and maximum of the numeric data columns:

In [61]:
bikes_min, bikes_max = bikes.min(), bikes.max()
bikes_min, bikes_max

(instant                1
 dteday        2011-01-01
 season                 1
 yr                     0
 mnth                   1
 hr                     0
 holiday                0
 weekday                0
 workingday             0
 weathersit             1
 temp                0.02
 atemp                0.0
 hum                  0.0
 windspeed            0.0
 casual                 0
 registered             0
 cnt                    1
 dtype: object,
 instant            17379
 dteday        2012-12-31
 season                 4
 yr                     1
 mnth                  12
 hr                    23
 holiday                1
 weekday                6
 workingday             1
 weathersit             4
 temp                 1.0
 atemp                1.0
 hum                  1.0
 windspeed         0.8507
 casual               367
 registered           886
 cnt                  977
 dtype: object)

In [64]:
# Alternatively display range of numeric columns using .agg(['min', 'max'])
bikes.select_dtypes(include=['number']).agg(['min', 'max'])

,instant,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
min,1,1,0,1,0,0,0,0,1,0.02,0.0,0.0,0.0000,0,0,1
max,17379,4,1,12,23,1,6,1,4,1.00,1.0,1.0,0.8507,367,886,977

### Quantiles

Pandas makes computing quantiles easy. This is how to get the median of a Series:

In [69]:
bikes['atemp'].quantile(0.5)

0.4848

Of course, the `quantiles` method can take a tuple as its argument. Compute the 10th, 25th, 50th, 75th, and 90th percentiles in one line of code:

In [72]:
#ANSWER
bikes['atemp'].quantile((0.1, 0.25, 0.5, 0.75, 0.9))

0.10    0.2424
0.25    0.3333
0.50    0.4848
0.75    0.6212
0.90    0.6970
Name: atemp, dtype: float64

### Cuts

Sometimes we want to split the sample not by the quantiles of the distribution but by the range of the data. Let's take a closer look at `atemp`:

In [73]:
type(bikes['atemp'])

pandas.core.series.Series

In [74]:
bikes.sample(5)

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
16658,16659,2012-12-01,4,1,12,21,0,6,0,2,0.30,0.3333,0.87,0.0000,23,135,158
10443,10444,2012-03-16,1,1,3,6,0,5,1,2,0.40,0.4091,0.87,0.1642,3,96,99
2990,2991,2011-05-09,2,0,5,12,0,1,1,1,0.60,0.6212,0.43,0.1940,35,160,195
9470,9471,2012-02-04,1,1,2,12,0,6,0,2,0.30,0.3182,0.70,0.0896,40,260,300
14639,14640,2012-09-07,3,1,9,4,0,5,1,1,0.62,0.5606,0.88,0.0000,1,7,8

Suppose we decide to sort these values into 4 bins of equal width, but we want to apply the resulting groups to the entire DataFrame. Basically, we need to add a row label that indicates which bin each sample belongs in. Let's call this label "atemp_level", and use the `cut` method to populate it:

In [75]:
atemp_level = pd.cut(bikes['atemp'], bins = 4)

What is `atemp_level`?

In [80]:
#ANSWER
print(type(atemp_level))
print(atemp_level)

<class 'pandas.core.series.Series'>
0        (0.25, 0.5]
1        (0.25, 0.5]
2        (0.25, 0.5]
3        (0.25, 0.5]
4        (0.25, 0.5]
            ...
17374    (0.25, 0.5]
17375    (0.25, 0.5]
17376    (0.25, 0.5]
17377    (0.25, 0.5]
17378    (0.25, 0.5]
Name: atemp, Length: 17379, dtype: category
Categories (4, interval[float64, right]): [(-0.001, 0.25] < (0.25, 0.5] < (0.5, 0.75] < (0.75, 1.0]]

Here is a random sample of `atemp_level`:

In [81]:
atemp_level.sample(5)

10292    (0.25, 0.5]
10605    (0.5, 0.75]
6518     (0.25, 0.5]
1826     (0.5, 0.75]
4690     (0.5, 0.75]
Name: atemp, dtype: category
Categories (4, interval[float64, right]): [(-0.001, 0.25] < (0.25, 0.5] < (0.5, 0.75] < (0.75, 1.0]]

In [82]:
bikes.iloc[[10292, 10605, 6518, 1826, 4690]]

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
10292,10293,2012-03-09,1,1,3,22,0,5,1,1,0.34,0.2879,0.31,0.4925,7,100,107
10605,10606,2012-03-23,2,1,3,0,0,5,1,1,0.56,0.5303,0.83,0.0000,30,65,95
6518,6519,2011-10-04,4,0,10,4,0,2,1,1,0.40,0.4091,0.82,0.0896,3,4,7
1826,1827,2011-03-21,2,0,3,20,0,1,1,1,0.56,0.5303,0.64,0.1940,16,106,122
4690,4691,2011-07-19,3,0,7,8,0,2,1,2,0.76,0.7273,0.70,0.1642,31,381,412

So, by default, `cut` produces labels that indicate the bin boundaries for each element in the series it was applied to. Usually, we will specify labels that are appropriate to the discretisation we are applying:

In [83]:
atemp_level = pd.cut(bikes['atemp'], bins = 4, labels = ["cool", "mild", "warm", "hot"])
atemp_level.sample(5)

9160    cool
8407    mild
916     cool
4608    warm
5166    warm
Name: atemp, dtype: category
Categories (4, object): ['cool' < 'mild' < 'warm' < 'hot']

Incorporate the new `atemp_level` column into the `bikes` DataFrame and use it to count the number of "mild" `atemp` entries in `season` 2:

In [86]:
#ANSWER
bikes['atemp_level'] = atemp_level # Adds new column to bikes DataFrame
mild_season2 = bikes[(bikes['atemp_level'] == 'mild') & 
                     (bikes['season'] == 2)].season.count()
print(mild_season2)

1829

In [87]:
# Alternatively, .shape[0] to count rows can be used, i.e.
bikes[(bikes['atemp_level'] == 'mild') & (bikes['season'] == 2)].shape[0]

1829

*Nb. The `atemp_level` variable we created is what the R language calls a "factor". Pandas has introduced a new data type called "category" that is similar to R's factors.*

# Synthetic Data

Sometimes we may want to generate test data, or we may need to initialise a series, matrix, or data frame for input to an algorithm. Numpy has several methods we can use for this.

Execute the following, then check the shape and content of each variable:

In [88]:
# Creating arrays with initial values
a = np.zeros((3))
b = np.ones((1,3))
c = np.random.randint(1,10,(2,3,4))   # randint(low, high, size)
d = np.arange(4)
e = np.array( [[1,2,3,4], [5,6,7,8]] )

In [102]:
print(f"a = {a}\nb = {b}\nc = {c}\nd = {d}\ne = {e}")

a = [0. 0. 0.]
b = [[1. 1. 1.]]
c = [[[2 5 8 4]
  [1 5 4 1]
  [9 2 9 9]]

 [[8 1 8 7]
  [6 3 1 6]
  [1 9 3 3]]]
d = [0 1 2 3]
e = [[1 2 3 4]
 [5 6 7 8]]

## Load Data

Load rock.csv and clean the dataset.

In [103]:
# ANSWER
rock = pd.read_csv("/Users/stephanienduaguba/Documents/DATA/rock.csv")

In [104]:
rock

,Song Clean,ARTIST CLEAN,Release Year,COMBINED,First?,Year?,PlayCount,F*G
0,Caught Up in You,.38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,.38 Special,NaN,Fantasy Girl by .38 Special,1,0,3,0
2,Hold On Loosely,.38 Special,1981,Hold On Loosely by .38 Special,1,1,85,85
3,Rockin' Into the Night,.38 Special,1980,Rockin' Into the Night by .38 Special,1,1,18,18
4,Art For Arts Sake,10cc,1975,Art For Arts Sake by 10cc,1,1,1,1
...,...,...,...,...,...,...,...,...
2225,She Loves My Automobile,ZZ Top,NaN,She Loves My Automobile by ZZ Top,1,0,1,0
2226,Tube Snake Boogie,ZZ Top,1981,Tube Snake Boogie by ZZ Top,1,1,32,32
2227,Tush,ZZ Top,1975,Tush by ZZ Top,1,1,109,109
2228,TV Dinners,ZZ Top,1983,TV Dinners by ZZ Top,1,1,1,1
2229,WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO,ZZ Top,1973,WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO by...,1,1,2,2

## Check Column Names

Check column names and clean.

In [105]:
# ANSWER
rock.columns

Index(['Song Clean', 'ARTIST CLEAN', 'Release Year', 'COMBINED', 'First?',
       'Year?', 'PlayCount', 'F*G'],
      dtype='object')

In [107]:
# Function to clean the column names
def clean_columns(column_names):
    clean_column_names = []
    for c in column_names:
        c = c.lower().replace(' ', '_')
        c = c.lower().replace('*', '')
        c = c.lower().replace('?', '')
        clean_column_names.append(c)
    return clean_column_names

In [108]:
# Testing the clean_columns function
rock.columns = clean_columns(rock.columns)
rock.columns

Index(['song_clean', 'artist_clean', 'release_year', 'combined', 'first',
       'year', 'playcount', 'fg'],
      dtype='object')

## Replace Null Values With 0

Check 'release_year' column whether this column has any null values or not. Replace null values with 0.

In [110]:
# ANSWER
# Checking the sum of null values in release_year
rock['release_year'].isnull().sum()

577

In [111]:
# Replacing null values in release_year with 0
rock['release_year'].fillna(0, inplace=True)

In [114]:
# Confirming replaced null values in release_year
rock['release_year'].isnull().sum()

0

## Check Datatypes of Dataset

Check datatypes of the dataset. Is there any column which should be int instead of object? Fix the column.

In [116]:
# ANSWER
# Checking datatypes in rock.csv
rock.dtypes

song_clean      object
artist_clean    object
release_year    object
combined        object
first            int64
year             int64
playcount        int64
fg               int64
dtype: object

In [117]:
# Converting release_year to int
rock['release_year'] = pd.to_numeric(rock['release_year'], errors='coerce').fillna(0).astype(int)

In [118]:
# Confirming int datatype for release_year column
rock.dtypes

song_clean      object
artist_clean    object
release_year     int64
combined        object
first            int64
year             int64
playcount        int64
fg               int64
dtype: object

## Check Min, Max of Each Column

Is there any illogical value in any column? How can we fix that?

In [120]:
# ANSWER
# Min and Max of each column using .agg() function
rock.agg(['min', 'max'])

# To determine illogical values, more context is required on the column names

,song_clean,artist_clean,release_year,combined,first,year,playcount,fg
min,#9 Dream,.38 Special,0,#9 Dream by John Lennon,1,0,0,0
max,Ziggy Stardust,a-ha,2014,Ziggy Stardust by David Bowie,1,1,142,142

## Write Some Functions

### Write a function that will take a row of a DataFrame and print out the song, artist, and whether or not the release date is < 1970

In [122]:
# ANSWER
# Function to print out song info
def check_song(row):
    print('Song:', row['song_clean'])
    print('Artist:', row['artist_clean'])
    print('Released before 1970:', row['release_year'] < 1970)
    print('\n')

In [123]:
# Testing check_song function
check_song(rock.iloc[0])

Song: Caught Up in You
Artist: .38 Special
Released before 1970: False

### Write a function that converts cells in a DataFrame to float and otherwise replaces them with np.nan

In [124]:
# ANSWER
# Function to convert column in data to float
def convert_to_float(column):
    column = pd.to_numeric(column, errors='coerce')
    return column

### Apply these functions to your dataset

In [130]:
# ANSWER
rock_float = rock.apply(convert_to_float)
rock_float

,song_clean,artist_clean,release_year,combined,first,year,playcount,fg
0,NaN,NaN,1982,NaN,1,1,82,82
1,NaN,NaN,0,NaN,1,0,3,0
2,NaN,NaN,1981,NaN,1,1,85,85
3,NaN,NaN,1980,NaN,1,1,18,18
4,NaN,NaN,1975,NaN,1,1,1,1
...,...,...,...,...,...,...,...,...
2225,NaN,NaN,0,NaN,1,0,1,0
2226,NaN,NaN,1981,NaN,1,1,32,32
2227,NaN,NaN,1975,NaN,1,1,109,109
2228,NaN,NaN,1983,NaN,1,1,1,1
2229,NaN,NaN,1973,NaN,1,1,2,2

### Describe the new float-only DataFrame.

In [133]:
# ANSWER
rock_float.describe().T

,count,mean,std,min,25%,50%,75%,max
song_clean,2.0,1012.000000,1367.544515,45.0,528.5,1012.0,1495.5,1979.0
artist_clean,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
release_year,2230.0,1465.331390,867.196161,0.0,0.0,1973.0,1981.0,2014.0
combined,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
first,2230.0,1.000000,0.000000,1.0,1.0,1.0,1.0,1.0
year,2230.0,0.741256,0.438043,0.0,0.0,1.0,1.0,1.0
playcount,2230.0,16.872646,25.302972,0.0,1.0,4.0,21.0,142.0
fg,2230.0,15.048430,25.288366,0.0,0.0,3.0,18.0,142.0

>



---



---



> > > > > > > > > © 2023 Institute of Data


---



---